In [4]:
import pandas as pd 
import numpy as np 
import matplotlib.pyplot as plt 
import seaborn as sns
%matplotlib inline

In [5]:
data=pd.read_csv("C:/Users/Khushal/Desktop/IIC/DA/ML/titanic.csv")

In [6]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [7]:
data=data.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis=1)

In [8]:
data.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [9]:
X=data.drop(['Survived'],axis=1)
y=data['Survived']

In [10]:
from sklearn.preprocessing import LabelEncoder
le=LabelEncoder()
X['n_Sex']=le.fit_transform(X['Sex'])
X['n_Age']=le.fit_transform(X['Age'])
X['n_Fare']=le.fit_transform(X['Fare'])

In [11]:
X.head()

   Pclass     Sex   Age     Fare  n_Sex  n_Age  n_Fare
0       3    male  22.0   7.2500      1     28      18
1       1  female  38.0  71.2833      0     51     207
2       3  female  26.0   7.9250      0     34      41
3       1  female  35.0  53.1000      0     47     189
4       3    male  35.0   8.0500      1     47      43

In [12]:
X=X.drop(['Sex','Age','Fare'],axis=1)

In [13]:
X.head()

   Pclass  n_Sex  n_Age  n_Fare
0       3      1     28      18
1       1      0     51     207
2       3      0     34      41
3       1      0     47     189
4       3      1     47      43

In [15]:
from sklearn.tree import DecisionTreeClassifier
mod=DecisionTreeClassifier()

In [16]:
from sklearn.model_selection import train_test_split

In [17]:
X_train, X_test, y_train, y_test = train_test_split( X, y, test_size=0.2, random_state=1)

In [18]:
mod.fit(X_train,y_train)

DecisionTreeClassifier()

In [19]:
pred=mod.predict(X_test)

In [20]:
from sklearn.metrics import confusion_matrix
from sklearn.metrics import accuracy_score

In [21]:
confusion_matrix(pred,y_test)

array([[87, 25],
       [19, 48]], dtype=int64)

In [22]:
accuracy_score(pred,y_test)*100

75.41899441340783